v2206/Projects/validatioin_CHAD/RTIthermal/system/probes.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2206
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U);

probeLocations
(
    (0.15 0.00  -0.025)
    (0.15 0.00   0.000)
    (0.15 0.00   0.025)
);

// ************************************************************************* //
